import 'package:flutter/material.dart';
import 'package:muslim_app/widgets/azkar/azkar_widget.dart';
import 'package:muslim_app/widgets/small_category.dart';

class DoaaAzkarView extends StatelessWidget {
  const DoaaAzkarView({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
            centerTitle: true,
            title:
                const Text('أدعِيَة وأذكار', style: TextStyle(fontSize: 30))),
        body: Padding(
            padding: const EdgeInsets.all(8.0),
            child: ListView(children: [
              SmallCategory(
                  imageIcon: 'asset/azkarimage/sun.png',
                  title: 'أذكار الصباح',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'أذكار الصباح',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ'),
                            AzkarModel(
                                content:
                                    '«الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ الرَّحْمـنِ الرَّحِيمِ مـالِكِ يَوْمِ الدِّينِ إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ اهدِنَــــا الصِّرَاطَ المُستَقِيمَ صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ».'),
                            AzkarModel(
                                content:
                                    '« وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ عَلَى مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَكِنَّ الشَّيَاطِينَ كَفَرُوا يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنْزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولَا إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ وَلَقَدْ عَلِمُوا لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الْآخِرَةِ مِنْ خَلَاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنْفُسَهُمْ لَوْ كَانُوا يَعْلَمُونَ».'),
                            AzkarModel(
                                content:
                                    '«اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ».'),
                            AzkarModel(
                                content:
                                    '«آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملآئكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير  لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين».'),
                            AzkarModel(
                                content:
                                    '« قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.'),
                            AzkarModel(
                                content:
                                    '« قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ».'),
                            AzkarModel(
                                content:
                                    '« قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ».'),
                            AzkarModel(
                                content:
                                    '« اللهمَّ بك أصبحنا وبك أمسينا وبك نحيا وبك نموتُ وإليك النُّشورُ».'),
                            AzkarModel(
                                content:
                                    '« بسم اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ ، في الأرضِ ، ولا في السَّماءِ ، وَهوَ السَّميعُ العليمُ»، (ثلاث مرات).'),
                            AzkarModel(
                                content:
                                    '« أَصبَحْنا على فِطرةِ الإسلامِ، وكَلِمةِ الإخلاصِ، ودِينِ نَبيِّنا محمَّدٍ -صلَّى اللهُ عليه وسلَّمَ- ومِلَّةِ أبِينا إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ».'),
                            AzkarModel(
                                content:
                                    ' أصبَحْنا وأصبَح المُلْكُ للهِ والحمدُ للهِ أسأَلُكَ مِن خيرِ هذا اليومِ ومِن خيرِ ما فيه وخيرِ ما بعدَه وأعوذُ بكَ مِن الكسَلِ والهرَمِ وسوءِ العُمُرِ وفتنةِ الدَّجَّالِ وعذابِ القبرِ»'),
                            AzkarModel(
                                content:
                                    '« رضيتُ باللهِ ربًّا وبالإسلامِ دينًا وبمحمَّدٍ صلَّى اللهُ عليه وسلَّم نبيًّا»« يا حيُّ يا قيومُ برحمتك أستغيثُ ، و أَصلِحْ لي شأني كلَّه ، ولا تَكِلْني إلى نفسي طرفَةَ عَينٍ أبدًا»'),
                            AzkarModel(
                                content:
                                    '« لا إلهَ إلَّا اللهُ وحدَه لا شريك له له المُلكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ»'),
                            AzkarModel(
                                content:
                                    '« اللهمَّ إني أسألُك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا»'),
                            AzkarModel(
                                content:
                                    '« اللَّهُمَّ أنتَ ربِّي لا إلَهَ إلَّا أنتَ خلَقتَني وأَنا عبدُكَ وأَنا على عَهْدِكَ ووعدِكَ ما استطَعتُ أعوذُ بِكَ من شرِّ ما صنعتُ أبوءُ لَكَ بنعمتِكَ عليَّ وأبوءُ بذَنبي فاغفِر لي فإنَّهُ لا يغفرُ الذُّنوبَ إلَّا أنتَ»'),
                            AzkarModel(
                                content:
                                    '« حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ»، (سبع مرات)'),
                            AzkarModel(
                                content:
                                    '« سُبْحَانَ اللهِ عَدَدَ خَلْقِهِ، سُبْحَانَ اللهِ رِضَا نَفْسِهِ، سُبْحَانَ اللهِ زِنَةَ عَرْشِهِ، سُبْحَانَ اللهِ مِدَادَ كَلِمَاتِهِ»، (ثلاث مرات)'),
                            AzkarModel(
                                content:
                                    '« اللهمَّ فاطرَ السمواتِ والأرضِ عالمَ الغيبِ والشهادةِ لا إلهَ إلَّا أنتَ ربَّ كلِّ شيءٍ ومَليكَه أعوذُ بك من شرِّ نفسي ومن شرِّ الشيطانِ وشرَكِه وأنْ أقترفَ على نفسي سوءًا أو أجرَّهُ إلى مسلمٍ»'),
                            AzkarModel(
                                content:
                                    '« اللَّهُمَّ إنِّي أصبَحتُ أنِّي أُشهِدُك، وأُشهِدُ حَمَلةَ عَرشِكَ، ومَلائِكَتَك، وجميعَ خَلقِكَ: بأنَّك أنتَ اللهُ لا إلهَ إلَّا أنتَ، وَحْدَك لا شريكَ لكَ، وأنَّ مُحمَّدًا عبدُكَ ورسولُكَ»'),
                            AzkarModel(
                                content:
                                    '« لا إلَه إلَّا اللهُ وحدَه لا شَريكَ له، له المُلكُ وله الحمدُ يُحيِي ويُميتُ وهو على كلِّ شيءٍ قديرٌ»'),
                            AzkarModel(
                                content:
                                    '« سبحان اللهِ والحمدُ للهِ ولا إلهَ إلَّا اللهُ واللهُ أكبرُ ولا حولَ ولا قوَّةَ إلَّا باللهِ العليِّ العظيمِ»، (مئة مرّةٍ أو أكثر)'),
                            AzkarModel(
                                content:
                                    '« سُبْحَانَ اللهِ وبِحَمْدِهِ»، (مئة مرة أو أكثر)'),
                            AzkarModel(
                                content:
                                    '« اللهمَّ عافني في بدَني اللهمَّ عافني في سمعي اللهمَّ عافني في بصري لا إلهَ إلا أنتَ، اللهمَّ إني أعوذُ بك من الكفرِ والفقرِ وأعوذُ بك من عذابِ القبرِ لا إلهَ إلا أنتَ»، (ثلاث مرات)'),
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/sunsets.png',
                  title: 'أذكارالمساء',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                            azkarName: 'أذكارالمساء',
                            azkarList: [
                              AzkarModel(
                                  content:
                                      '– اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ. (مرة واحدة)'),
                              AzkarModel(
                                  content:
                                      '-أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ المُشْرِكِينَ. (مرة واحدة)'),
                              AzkarModel(
                                  content:
                                      '– سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– اللّهُـمَّ إِنّـي أَعوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. (مرة واحدة)'),
                              AzkarModel(
                                  content:
                                      'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. (مرة واحدة)'),
                              AzkarModel(
                                  content:
                                      '– اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءًا أَوْ أَجُـرَّهُ إِلـى مُسْـلِم. (مرة واحدة)'),
                              AzkarModel(
                                  content:
                                      ' أَعوذُ بِكَلِماتِ اللّهِ التّامّاتِ مِنْ شَرِّ ما خَلَق. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. (10 مرّات). من صلى عليّ حين يصبح وحين يمسي أدركته شفاعتي يوم القيامة'),
                              AzkarModel(
                                  content:
                                      '– اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ. (3 مرات).– يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ. (3 مرات)'),
                              AzkarModel(
                                  content:
                                      '– لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. (100 مرة)'),
                              AzkarModel(
                                  content:
                                      '– سُبْحـانَ اللهِ وَبِحَمْـدِهِ. (100 مرة).حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ، بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ'),
                            ]);
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/sleep.png',
                  title: 'دعاء النوم',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء النوم',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'أوصى الرسول - صلى الله عليه وسلم -  بقول دعاء قبل النوم إذا أتى الشخص مضجعه، وذلك بعد أن يتوضأ وضوءَه للصلاةِ، ثم يضطَجِع على شِقِّه الأيمنِ، فإن مات من ليلتِه، فهو على الفطرةِ، ويستحب للمسلم أن يردد دعاء قبل النوم بما ورد عن النبي ومنه قول "باسمِكَ ربِّي وَضعتُ جَنبي وبِكَ أرفعُهُ، إن أمسَكْتَ نفسي فارحَمها، وإن أرسلتَها فاحفَظها بما تحفَظُ بِهِ عبادَكَ الصَّالحينَ".'),
                            AzkarModel(content: '"اللهم باسمِك أحيا وأموتُ" '),
                            AzkarModel(
                                content:
                                    'اللَّهُمَّ أسْلَمْتُ نَفْسِي إلَيْكَ، وفَوَّضْتُ أمْرِي إلَيْكَ، ووَجَّهْتُ وجْهِي إلَيْكَ، وأَلْجَأْتُ ظَهْرِي إلَيْكَ، رَغْبَةً ورَهْبَةً إلَيْكَ، لا مَلْجَا ولَا مَنْجَا مِنْكَ إلَّا إلَيْكَ، آمَنْتُ بكِتَابِكَ الذي أنْزَلْتَ، وبِنَبِيِّكَ الذي أرْسَلْتَ'),
                            AzkarModel(
                                content:
                                    '"اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأرْضِ وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بكَ مِن شَرِّ كُلِّ شيءٍ أَنْتَ آخِذٌ بنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فليسَ قَبْلَكَ شيءٌ، وَأَنْتَ الآخِرُ فليسَ بَعْدَكَ شيءٌ، وَأَنْتَ الظَّاهِرُ فليسَ فَوْقَكَ شيءٌ، وَأَنْتَ البَاطِنُ فليسَ دُونَكَ شيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ".'),
                            AzkarModel(
                                content:
                                    '"اللَّهمَّ إنِّي أعوذُ بوجهِكَ الكريمِ، وكلماتِكَ التامةِ من شرِّ ما أنتَ آخذٌ بناصيتِهِ، اللَّهمَّ أنتَ تكشفُ المغرمَ والمأثمَ، اللَّهمَّ لا يهزمُ جندُكَ، ولا يخلفُ وعدُكَ، ولا ينفعُ ذا الجدِّ منكَ الجدُّ، سبحانَكَ اللَّهمَّ وبحمدِكَ".'),
                            AzkarModel(
                                content:
                                    '"بسم اللهِ وضعتُ جنبي، اللهم اغفر لي ذنبي، وأخْسئْ شيطاني، وفكَّ رِهاني، واجعلني في النديِّ الأعلى".'),
                            AzkarModel(
                                content:
                                    '"الحمد لله الذي كفاني وآواني، وأطعمني وسقاني، والذي منّ عليّ فأفضل، والذي أعطاني فأجزل، الحمد لله على كل حال، اللهم رب كل شيء ومليكه، وإله كل شيء أعوذ بك من النار".'),
                            AzkarModel(
                                content:
                                    '"اللَّهمَّ أنتَ خلَقْتَ نفسي وأنتَ تتوفَّاها، لك مماتُها ومحياها، اللَّهمَّ إنْ توفَّيْتَها فاغفِرْ لها وإنْ أحيَيْتَها فاحفَظْها، اللَّهمَّ إنِّي أسأَلُك العافيةَ".'),
                            AzkarModel(
                                content:
                                    '"اللهم فاطر السموات والأرض، عالم الغيب والشهادة رب كل شيء ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه، قال: قلها إذا أصبحت، وإذا أمسيت، وإذا أخذت مضجعك".'),
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/ablution.png',
                  title: 'دعاء الوضوء',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء الوضوء',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'قبل الوضوء تقول: بسم الله.                                                         أما بعد الوضوء فإنك تقول: أشهد أن لا إله إلا الله وأشهد أن محمداً عبده ورسوله، اللهم اجعلني من التوابين واجعلني من المتطهرين. وأما ما ذكره بعض أهل العلم من أن لكل عضو ذكراً مخصوصاً فإن هذا لا أصل له؛ ولهذا لا يسن للإنسان أن يدعو الله سبحانه وتعالى كلما غسل وجهه قال اللهم حرم وجهي على النار، وإذا غسل يديه قال ذكراً، وكذلك عند مسح رأسه قال ذكراً، هذا لا أصل له في الشرع، والتعبد لله به من البدع.')
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/mosque.png',
                  title: 'دعاء المسجد',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء المسجد',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'عَنْ أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: ((إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ، فَلْيُسَلِّمْ عَلَى النَّبِيِّ صلى الله عليه وسلم، وَلْيَقُلْ: اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ، وَإِذَا خَرَجَ فَلْيُسَلِّمْ عَلَى النَّبِيِّ صلى الله عليه وسلم، وَلْيَقُلْ: اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ))')
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/clothis.png',
                  title: 'دعاء لبس الثوب',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء لبس الثوب',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'وعن معاذ بن أنس أن رسول الله قال: (( ومَنْ لَبِسَ ثوباً فقال : الحمدُ لله الذي كَساني هذا الثـوب ورَزَقنيه مِنْ غيِر حـولٍ منِّي ولا قُوّةٍ, غُفـِرَ له مـا تقـدَّم مـِنْ ذنْبِه ))')
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/travil.png',
                  title: 'دعاء السفر ',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء السفر ',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'روى مسلم في صحيحه عن ابن عمر أن رسول الله صلى الله وسلم ، ولقد كان إذا استوى على على بعيره خارجًا إلى سفر ، كبر ثلاثًا  ، ثم قال : سُبْحَانَ الّذِي سَخّرَ لَنَا هَذَا وَمَا كُنّا لَهُ مُقْرِنِينَ* وَإِنّا إِلَىَ رَبّنَا لَمُنْقَلِبُونَ. اللّهُمّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرّ وَالتّقْوَىَ. وَمِنَ الْعَمَلِ مَا تَرْضَىَ. اللّهُمّ هَوّنْ عَلَيْنَا سَفَرَنَا هَذَا. وَاطْوِ عَنّا بُعْدَهُ. اللّهُمّ أَنْتَ الصّاحِبُ فِي السّفَرِ. وَالْخَلِيفَةُ فِي الأَهْلِ. اللّهُمّ إِنّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ، فِي الْمَالِ وَالأَهْلِ”. وَإِذَا رَجَعَ قَالَهُنّ. وَزَادَ فِيهِنّ: “آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبّنَا حَامِدُونَ“. ')
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/market.png',
                  title: 'دعاء دخول السوق',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء دخول السوق',
                          azkarList: [
                            AzkarModel(
                                content:
                                    '«لاإله إلا الله وحده لاشريك له ، له الملك وله الحمد ، يُحيي ويُميت ، وهو حي لا يموت ، بيده الخير وهو على كل شيء قدير»، رواه الترمذي.'),
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/home.png',
                  title: 'دعاء  المنزل',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'دعاء  المنزل',
                          azkarList: [
                            AzkarModel(
                                content:
                                    'عن أمِّ سلمة رضي الله عنها قالت: ما خرج النبي صلى الله عليه وسلم من بيتي قطُّ إلا رفع طَرْفَهُ إلى السماء فقال: (اللَّهُمَّ أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ)، وفي حديث أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم قال: (إِذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ فَقَالَ: بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، ولاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ. قَالَ: يُقَالُ حِينَئِذٍ: هُدِيتَ، وَكُفِيتَ، وَوُقِيتَ، فَتَتَنَحَّى لَهُ الشَّيَاطِينُ، فَيَقُولُ لَهُ شَيْطَانٌ آخَرُ: كَيْفَ لَكَ بِرَجُلٍ قَدْ هُدِيَ وَكُفِيَ وَوُقِيَ؟) رواهما أبو داود في سننه، وصححهما الألباني.'),
                            AzkarModel(
                                content:
                                    'عن أبي هريرة عن النبي قال: (( إذا خرَجت من مَنْـزلك فَصَلّ ركعتين يمنعانكَ من مخرجِ السوءِ, وإذا دَخَلْتَ إلى منـزلك فصَلّ ركعتين يمنعانكَ من مدخل السوء ))'),
                            AzkarModel(
                                content: '((((الذكر عند دخول المنـزل))))'),
                            AzkarModel(
                                content:
                                    'عن أبي أمامة أن رسول الله قال: (( ثلاثةٌ كلُّهمْ ضامنٌ على الله إن عاش رُزقِ وكُفِيَ, وإن ماتَ أدخلَهُ اللهُ الجنّة, من دخل بيتَه فَسَلَّمَ, فهو ضامنٌ على الله....))')
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
              SmallCategory(
                  imageIcon: 'asset/azkarimage/toilet.png',
                  title: 'الدخول والخروج من الحمام',
                  onTap: () => Navigator.of(context)
                          .push(MaterialPageRoute(builder: (context) {
                        return AzkarWidget(
                          azkarName: 'الدخول والخروج من الحمام',
                          azkarList: [
                            AzkarModel(
                                content: '(((((دُعَاءُ دُخُولِ الْخَلاءِ)))))'),
                            AzkarModel(
                                content:
                                    '((بِسْمِ اللَّهِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِثِ)).'),
                            AzkarModel(
                                content:
                                    '(((دُعَاءُ الخُرُوجِ مِنَ الْخَلاءِ)))'),
                            AzkarModel(content: '(غُفْرَانَكَ)'),
                          ],
                        );
                      }))),
              const SizedBox(
                height: 2,
              ),
            ])));
  }
}
